# Напишите программу на Python, чтобы получить разницу между двумя списками

list_1 = [2,3,4,5]
list_2 = [1,2,3,7]
print (list(set(list_1) - set(list_2)))