"""
4. Напишите шаблон регулярного выражения,
  который соответствовал бы следующему формату
  времени: YYYY-MM-DDThh:mm:ss±hh:mm (ISO формат).
"""

import re

time_format = re.compile(
    r'(\d{4})-(\d{2})-(\d{2})T(\d{2})'
    r'\:(\d{2})\:(\d{2})[+-](\d{2})\:(\d{2})')
print(bool(time_format.match(
    "2020-02-18T13:36:00+01:00")))
